; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob27) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 hoist13 hoist14 - hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate5)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 distributor2)
	(clear pallet6)
	(at pallet7 distributor2)
	(clear crate0)
	(at pallet8 depot2)
	(clear pallet8)
	(at pallet9 distributor2)
	(clear crate4)
	(at pallet10 distributor1)
	(clear crate6)
	(at pallet11 distributor0)
	(clear crate3)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 359)
	(at truck1 depot2)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 337)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at hoist7 depot1)
	(available hoist7)
	(at hoist8 distributor0)
	(available hoist8)
	(at hoist9 distributor2)
	(available hoist9)
	(at hoist10 distributor1)
	(available hoist10)
	(at hoist11 distributor1)
	(available hoist11)
	(at hoist12 distributor0)
	(available hoist12)
	(at hoist13 distributor2)
	(available hoist13)
	(at hoist14 distributor1)
	(available hoist14)
	(at crate0 distributor2)
	(on crate0 pallet7)
	(= (weight crate0) 74)
	(at crate1 distributor0)
	(on crate1 pallet11)
	(= (weight crate1) 39)
	(at crate2 distributor1)
	(on crate2 pallet10)
	(= (weight crate2) 12)
	(at crate3 distributor0)
	(on crate3 crate1)
	(= (weight crate3) 9)
	(at crate4 distributor2)
	(on crate4 pallet9)
	(= (weight crate4) 46)
	(at crate5 depot2)
	(on crate5 pallet2)
	(= (weight crate5) 32)
	(at crate6 distributor1)
	(on crate6 crate2)
	(= (weight crate6) 21)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet3)
		(on crate1 pallet11)
		(on crate2 pallet2)
		(on crate3 pallet8)
		(on crate4 pallet0)
		(on crate5 crate4)
		(on crate6 crate5)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist14 crate6 crate2 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist14) (on crate6 crate2)
   added: (lifting hoist14 crate6) (clear crate2)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 7
2. (lift hoist10 crate2 pallet10 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist10) (on crate2 pallet10)
   added: (lifting hoist10 crate2) (clear pallet10)
   changed: (fuel-cost) from 1 to 2
   goals met: 1 of 7
3. (lift hoist3 crate3 crate1 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist3) (on crate3 crate1)
   added: (lifting hoist3 crate3) (clear crate1)
   changed: (fuel-cost) from 2 to 3
   goals met: 1 of 7
4. (load hoist3 crate3 truck0 distributor0)
   deleted: (lifting hoist3 crate3)
   added: (in crate3 truck0) (available hoist3)
   changed: (current_load truck0) from 0 to 9
   goals met: 1 of 7
5. (lift hoist5 crate4 pallet9 distributor2)
   deleted: (at crate4 distributor2) (clear crate4) (available hoist5) (on crate4 pallet9)
   added: (lifting hoist5 crate4) (clear pallet9)
   changed: (fuel-cost) from 3 to 4
   goals met: 1 of 7
6. (lift hoist6 crate0 pallet7 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist6) (on crate0 pallet7)
   added: (lifting hoist6 crate0) (clear pallet7)
   changed: (fuel-cost) from 4 to 5
   goals met: 1 of 7
7. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 5 to 15
   goals met: 1 of 7
8. (load hoist10 crate2 truck0 distributor1)
   deleted: (lifting hoist10 crate2)
   added: (in crate2 truck0) (available hoist10)
   changed: (current_load truck0) from 9 to 21
   goals met: 1 of 7
9. (load hoist14 crate6 truck0 distributor1)
   deleted: (lifting hoist14 crate6)
   added: (in crate6 truck0) (available hoist14)
   changed: (current_load truck0) from 21 to 42
   goals met: 1 of 7
10. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 15 to 25
   goals met: 1 of 7
11. (unload hoist2 crate3 truck0 depot2)
   deleted: (in crate3 truck0) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck0) from 42 to 33
   goals met: 1 of 7
12. (drop hoist2 crate3 pallet8 depot2)
   deleted: (lifting hoist2 crate3) (clear pallet8)
   added: (available hoist2) (at crate3 depot2) (clear crate3) (on crate3 pallet8)
   goals met: 2 of 7
13. (unload hoist2 crate6 truck0 depot2)
   deleted: (in crate6 truck0) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck0) from 33 to 12
   goals met: 2 of 7
14. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 25 to 35
   goals met: 2 of 7
15. (load hoist6 crate0 truck0 distributor2)
   deleted: (lifting hoist6 crate0)
   added: (in crate0 truck0) (available hoist6)
   changed: (current_load truck0) from 12 to 86
   goals met: 2 of 7
16. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 35 to 45
   goals met: 2 of 7
17. (unload hoist3 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist3)
   added: (lifting hoist3 crate0)
   changed: (current_load truck0) from 86 to 12
   goals met: 2 of 7
18. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 45 to 55
   goals met: 2 of 7
19. (drop hoist3 crate0 pallet3 distributor0)
   deleted: (lifting hoist3 crate0) (clear pallet3)
   added: (available hoist3) (at crate0 distributor0) (clear crate0) (on crate0 pallet3)
   goals met: 3 of 7
20. (load hoist5 crate4 truck0 distributor2)
   deleted: (lifting hoist5 crate4)
   added: (in crate4 truck0) (available hoist5)
   changed: (current_load truck0) from 12 to 58
   goals met: 3 of 7
21. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 55 to 65
   goals met: 3 of 7
22. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 65 to 75
   goals met: 3 of 7
23. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   changed: (current_load truck0) from 58 to 12
   goals met: 3 of 7
24. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 75 to 85
   goals met: 3 of 7
25. (drop hoist0 crate4 pallet0 depot0)
   deleted: (lifting hoist0 crate4) (clear pallet0)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 pallet0)
   goals met: 4 of 7
26. (load hoist2 crate6 truck1 depot2)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck1) (available hoist2)
   changed: (current_load truck1) from 0 to 21
   goals met: 4 of 7
27. (lift hoist2 crate5 pallet2 depot2)
   deleted: (at crate5 depot2) (clear crate5) (available hoist2) (on crate5 pallet2)
   added: (lifting hoist2 crate5) (clear pallet2)
   changed: (fuel-cost) from 85 to 86
   goals met: 4 of 7
28. (load hoist2 crate5 truck0 depot2)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck0) (available hoist2)
   changed: (current_load truck0) from 12 to 44
   goals met: 4 of 7
29. (unload hoist2 crate2 truck0 depot2)
   deleted: (in crate2 truck0) (available hoist2)
   added: (lifting hoist2 crate2)
   changed: (current_load truck0) from 44 to 32
   goals met: 4 of 7
30. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 86 to 96
   goals met: 4 of 7
31. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 96 to 106
   goals met: 4 of 7
32. (unload hoist0 crate5 truck0 depot0)
   deleted: (in crate5 truck0) (available hoist0)
   added: (lifting hoist0 crate5)
   changed: (current_load truck0) from 32 to 0
   goals met: 4 of 7
33. (drop hoist0 crate5 crate4 depot0)
   deleted: (lifting hoist0 crate5) (clear crate4)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 crate4)
   goals met: 5 of 7
34. (unload hoist0 crate6 truck1 depot0)
   deleted: (in crate6 truck1) (available hoist0)
   added: (lifting hoist0 crate6)
   changed: (current_load truck1) from 21 to 0
   goals met: 5 of 7
35. (drop hoist2 crate2 pallet2 depot2)
   deleted: (lifting hoist2 crate2) (clear pallet2)
   added: (available hoist2) (at crate2 depot2) (clear crate2) (on crate2 pallet2)
   goals met: 6 of 7
36. (drop hoist0 crate6 crate5 depot0)
   deleted: (lifting hoist0 crate6) (clear crate5)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 crate5)
   goals met: 7 of 7
